jaredgrinberg/stm32-bare-metal-programming/i2c_axdl345/Src/i2c.c
#include "stm32f4xx.h"



#define 	GPIOBEN						(1U<<1)
#define 	I2C1EN						(1U<<21)
#define 	I2C_100KHZ					80		//0B 0101 0000 = Decimal = 80
#define 	SD_MODE_MAX_RISE_TIME		17		// there are various tools to compute this
#define		CR1_PE						(1U<<0)

#define		SR2_BUSY					(1U<<1)
#define     CR1_START					(1U<<8) // this is the start bit
#define		SR1_SB						(1U<<0) // setting start flag
#define		SR1_ADDR					(1U<<1)
#define		SR1_TXE						(1U<<7)
#define		CR1_ACK						(1U<<10)
#define     CR1_STOP					(1U<<9)
#define		SR1_RXNE					(1U<<6)
#define	    SR1_BTF						(1U<<2)

/*
 * PB8 ---- SCL
 * PB9 ----- SDA
 * */

void I2C1_init(void)
{
	/*Enable clock access to GPIOB*/
	RCC->AHB1ENR |=GPIOBEN;

	/*Set PB8 and PB9 mode to alternate function*/
	// from alternate function table, using AF04 and PB8 and PB9
	// this for PB8
	GPIOB->MODER &=~(1U<<16);
	GPIOB->MODER |=(1U<<17);
	// this for PB9
	GPIOB->MODER &=~(1U<<18);
	GPIOB->MODER |=(1U<<19);

	/*Set PB8 and PB9 output type to open drain*/
	// i2c requires this
	GPIOB->OTYPER |=(1U<<8);
	GPIOB->OTYPER |=(1U<<9);

	/*Enable Pull-up for PB8 and PB9*/
	// they require 2 bits, want pull up so 01
	// this for PB8
	GPIOB->PUPDR |=(1U<<16);
	GPIOB->PUPDR &=~(1U<<17);
	// this for PB9
	GPIOB->PUPDR |=(1U<<18);
	GPIOB->PUPDR &=~(1U<<19);

	/*Set PB8 and PB9 alternate function type to I2C (AF4)*/
	GPIOB->AFR[1] &=~(1U<<0);
	GPIOB->AFR[1] &=~(1U<<1);
	GPIOB->AFR[1] |=(1U<<2);
	GPIOB->AFR[1] &=~(1U<<3);

	GPIOB->AFR[1] &=~(1U<<4);
	GPIOB->AFR[1] &=~(1U<<5);
	GPIOB->AFR[1] |=(1U<<6);
	GPIOB->AFR[1] &=~(1U<<7);


	/*Enable clock access to I2C1*/
	RCC->APB1ENR |= I2C1EN;

	/*Enter reset mode  */
	I2C1->CR1 |= (1U<<15);

	/*Come out of reset mode  */
	I2C1->CR1 &=~(1U<<15);

	/*Set Peripheral clock frequency*/
	// in this register, first 6 bits are for frequency
	// need to set binary value that corresponds to the clock frequency. all in Mhz
	I2C1->CR2 = (1U<<4);   //16 Mhz

	/*Set I2C to standard mode, 100kHz clock */
	I2C1->CCR = I2C_100KHZ;

	/*Set rise time */
	I2C1->TRISE = SD_MODE_MAX_RISE_TIME;

	/*Enable I2C1 module */
	// this is the peripheral enable
	I2C1->CR1 |= CR1_PE;


}

void I2C1_byteRead(char saddr, char maddr, char* data) {
// saddr = slave address, maddr = master address
	volatile int tmp;

	/* Wait until bus not busy */
	while (I2C1->SR2 & (SR2_BUSY)){}

	/* Generate start condition */
	I2C1->CR1 |= CR1_START;

	/* Wait until start flag is set */
	while (!(I2C1->SR1 & (SR1_SB))){}

	/* Transmit slave address + Write */
	// this is to write it
	I2C1->DR = saddr << 1;

	/* Wait until addr flag is set */
	while (!(I2C1->SR1 & (SR1_ADDR))){}

	/* Clear addr flag */
	tmp = I2C1->SR2;

	/* Send memory address */
	I2C1->DR = maddr;

	/*Wait until transmitter empty */
	while (!(I2C1->SR1 & SR1_TXE)){}

	/*Generate restart */
	I2C1->CR1 |= CR1_START;

	/* Wait until start flag is set */
	while (!(I2C1->SR1 & SR1_SB)){}

	/* Transmit slave address + Read */
	// now we want to read it
	I2C1->DR = saddr << 1 | 1;

	/* Wait until addr flag is set */
	while (!(I2C1->SR1 & (SR1_ADDR))){}

    /* Disable Acknowledge */
    I2C1->CR1 &= ~CR1_ACK;

    /* Clear addr flag */
    tmp = I2C1->SR2;

    /* Generate stop after data received */
    I2C1->CR1 |= CR1_STOP;

    /* Wait until RXNE flag is set */
    while (!(I2C1->SR1 & SR1_RXNE)){}

    /* Read data from DR */
    *data++ = I2C1->DR;
}

void I2C1_burstRead(char saddr, char maddr, int n, char* data) {

	volatile int tmp;

	/* Wait until bus not busy */
	while (I2C1->SR2 & (SR2_BUSY)){}

	/* Generate start */
	I2C1->CR1 |= CR1_START;

	/* Wait until start flag is set */
	while (!(I2C1->SR1 & SR1_SB)){}

	/* Transmit slave address + Write */
	// this is to write it
	I2C1->DR = saddr << 1;

	/* Wait until addr flag is set */
	while (!(I2C1->SR1 & SR1_ADDR)){}

	/* Clear addr flag */
	tmp = I2C1->SR2;

	/* Wait until transmitter empty */
	while (!(I2C1->SR1 & SR1_TXE)){}

	/*Send memory address */
	I2C1->DR = maddr;

	/*Wait until transmitter empty */
	while (!(I2C1->SR1 & SR1_TXE)){}

	/*Generate restart */
	I2C1->CR1 |= CR1_START;

	/* Wait until start flag is set */
    while (!(I2C1->SR1 & SR1_SB)){}

    /* Transmit slave address + Read */
    // now we want to read it
    I2C1->DR = saddr << 1 | 1;

    /* Wait until addr flag is set */
    while (!(I2C1->SR1 & (SR1_ADDR))){}

    /* Clear addr flag */
    tmp = I2C1->SR2;

    /* Enable Acknowledge */
    I2C1->CR1 |=  CR1_ACK;

    while(n > 0U)
    {
    	/*if there is one byte*/
    	// because you can still pass one byte as argument
    	if(n == 1U)
    	{
    		/* Disable Acknowledge */
    	    I2C1->CR1 &= ~CR1_ACK;

    	    /* Generate Stop */
    	    I2C1->CR1 |= CR1_STOP;

 			/* Wait for RXNE flag set */
            while (!(I2C1->SR1 & SR1_RXNE)){}

            /* Read data from DR */
            *data++ = I2C1->DR;
            break;
    	}
    	else
    	{
       	 /* Wait until RXNE flag is set */
           while (!(I2C1->SR1 & SR1_RXNE)){}

           /* Read data from DR */
           (*data++) = I2C1->DR;

           n--;
    	}
    }

}

void I2C1_burstWrite(char saddr, char maddr, int n, char* data) {

	volatile int tmp;

	/* Wait until bus not busy */
	while (I2C1->SR2 & (SR2_BUSY)){}

	 /* Generate start */
    I2C1->CR1 |= CR1_START;

    /* Wait until start flag is set */
    while (!(I2C1->SR1 & (SR1_SB))){}

    /* Transmit slave address */
    I2C1->DR = saddr << 1;

    /* Wait until addr flag is set */
    while (!(I2C1->SR1 & (SR1_ADDR))){}

    /* Clear addr flag */
    tmp = I2C1->SR2;

    /* Wait until data register empty */
    while (!(I2C1->SR1 & (SR1_TXE))){}

    /* Send memory address */
    I2C1->DR = maddr;

    for (int i = 0; i < n; i++) {

    	/* Wait until data register empty */
        while (!(I2C1->SR1 & (SR1_TXE))){}

        /* Transmit memory address */
        I2C1->DR = *data++;
    }

    /* Wait until transfer finished */
    while (!(I2C1->SR1 & (SR1_BTF))){}

    /* Generate stop */
    I2C1->CR1 |= CR1_STOP;
}


